performance/reports/runs/normal-day-2026-08-20T05-02-20/summary.txt
     ✓ login 200
     ✓ post detail 200
     ✓ board list 200
     ✓ comment create 2xx
     ✓ hot daily 200
     ✓ unread count 200
     ✓ post list 200
     ✓ notif list 200
     ✓ comment list 200
     ✓ read one 200
     ✓ chat rooms 200
     ✓ chat messages 200
     ✓ scrap 2xx
     ✓ post create 2xx
     ✓ chat read 200
     ✓ post reaction 2xx
     ✓ refresh 200
     ✓ meal today 200
     ✓ timetable today 200
     ✓ post search 200
     ✓ read all 200
     ✓ comment reaction 200
     ✓ user info 200
     ✓ my posts 200
     ✓ ws handshake 101
     ✓ friend list 200
     ✓ logout 200
     ✓ received reqs 200
     ✓ meal month 200
     ✓ post update 200
     ✓ post delete 200

     auth_token_refreshes...........: 18      0.02942/s
     chat_ws_messages_sent..........: 579     0.94634/s
     chat_ws_rtt....................: avg=25.38ms  min=14ms    med=22ms     max=342ms    p(90)=35ms     p(95)=39ms     p(99)=51.42ms 
     checks.........................: 100.00% ✓ 7806      ✗ 0    
     ✓ { phase:measure }............: 100.00% ✓ 5121      ✗ 0    
     ✓ { phase:rampdown }...........: 100.00% ✓ 1174      ✗ 0    
     ✓ { phase:warmup }.............: 100.00% ✓ 1511      ✗ 0    
     data_received..................: 348 MB  569 kB/s
     data_sent......................: 3.2 MB  5.2 kB/s
     http_req_blocked...............: avg=14.18µs  min=1.69µs  med=5.55µs   max=14.98ms  p(90)=12.05µs  p(95)=16.12µs  p(99)=256.68µs
     http_req_connecting............: avg=5.81µs   min=0s      med=0s       max=14.88ms  p(90)=0s       p(95)=0s       p(99)=166.82µs
     http_req_duration..............: avg=78.31ms  min=1.24ms  med=6.61ms   max=10.35s   p(90)=65.35ms  p(95)=312.34ms p(99)=1.77s   
       { expected_response:true }...: avg=78.31ms  min=1.24ms  med=6.61ms   max=10.35s   p(90)=65.35ms  p(95)=312.34ms p(99)=1.77s   
     ✓ { feature:auth }.............: avg=110.91ms min=14.3ms  med=81.52ms  max=1.04s    p(90)=151ms    p(95)=343.24ms p(99)=789.7ms 
     ✓ { feature:board }............: avg=4.61ms   min=1.24ms  med=3.32ms   max=105.82ms p(90)=7.61ms   p(95)=8.94ms   p(99)=17.89ms 
     ✓ { feature:chat }.............: avg=7.44ms   min=2.12ms  med=5.17ms   max=176.4ms  p(90)=11.57ms  p(95)=14.1ms   p(99)=41.35ms 
     ✓ { feature:comment }..........: avg=385.44ms min=1.98ms  med=45.05ms  max=10.35s   p(90)=1.53s    p(95)=1.81s    p(99)=3.07s   
     ✓ { feature:friend }...........: avg=5.53ms   min=2.66ms  med=4.31ms   max=17.74ms  p(90)=9.95ms   p(95)=11.02ms  p(99)=15.5ms  
     ✓ { feature:hot }..............: avg=15.25ms  min=8.1ms   med=11.64ms  max=277.58ms p(90)=21.05ms  p(95)=25.65ms  p(99)=80.37ms 
     ✓ { feature:mypage }...........: avg=6.54ms   min=2.22ms  med=3.69ms   max=166.95ms p(90)=9.66ms   p(95)=10.68ms  p(99)=50.34ms 
     ✓ { feature:notification }.....: avg=10.56ms  min=2.21ms  med=7.11ms   max=352.12ms p(90)=19.97ms  p(95)=24.84ms  p(99)=54.2ms  
     ✓ { feature:post }.............: avg=8.86ms   min=1.79ms  med=5.32ms   max=433.21ms p(90)=15.58ms  p(95)=24.92ms  p(99)=54.38ms 
     ✓ { feature:reaction }.........: avg=28.35ms  min=15.92ms med=22.81ms  max=359.98ms p(90)=34.07ms  p(95)=41.67ms  p(99)=125.28ms
     ✓ { feature:school }...........: avg=5.24ms   min=2.61ms  med=3.93ms   max=19.58ms  p(90)=9.75ms   p(95)=10.41ms  p(99)=15.02ms 
     ✓ { feature:scrap }............: avg=23.59ms  min=13.95ms med=21.48ms  max=71.16ms  p(90)=32.43ms  p(95)=37.06ms  p(99)=55.88ms 
     ✓ { feature:timetable }........: avg=4.73ms   min=2.26ms  med=3.13ms   max=35.94ms  p(90)=7.71ms   p(95)=8.31ms   p(99)=23.55ms 
     ✓ { op:auth }..................: avg=110.91ms min=14.3ms  med=81.52ms  max=1.04s    p(90)=151ms    p(95)=343.24ms p(99)=789.7ms 
     ✗ { op:read,phase:measure }....: avg=73.84ms  min=1.24ms  med=5.5ms    max=4.09s    p(90)=40.26ms  p(95)=324.46ms p(99)=1.77s   
     ✓ { op:write,phase:measure }...: avg=20.98ms  min=2.46ms  med=19.36ms  max=175.95ms p(90)=35.31ms  p(95)=40.57ms  p(99)=56.23ms 
     ✓ { page:0 }...................: avg=9.71ms   min=1.79ms  med=3.75ms   max=156.36ms p(90)=29.41ms  p(95)=35.99ms  p(99)=63.92ms 
     ✓ { page:1 }...................: avg=6.7ms    min=2.04ms  med=3.33ms   max=77.73ms  p(90)=10.41ms  p(95)=27.59ms  p(99)=60.06ms 
     ✓ { page:2 }...................: avg=12.79ms  min=2.12ms  med=3.52ms   max=433.21ms p(90)=25.02ms  p(95)=28.84ms  p(99)=172.09ms
     ✓ { page:3 }...................: avg=11.2ms   min=1.98ms  med=3.42ms   max=163ms    p(90)=24.21ms  p(95)=34.89ms  p(99)=118.7ms 
     ✓ { page:4 }...................: avg=11.25ms  min=2.01ms  med=4.03ms   max=76.07ms  p(90)=37.57ms  p(95)=45.49ms  p(99)=68.77ms 
     ✓ { phase:measure }............: avg=69.21ms  min=1.24ms  med=5.82ms   max=4.09s    p(90)=38.38ms  p(95)=251.99ms p(99)=1.75s   
     ✓ { phase:rampdown }...........: avg=94.38ms  min=1.79ms  med=7.2ms    max=5.2s     p(90)=72.05ms  p(95)=464.68ms p(99)=1.88s   
     ✓ { phase:warmup }.............: avg=96.67ms  min=2.28ms  med=9.65ms   max=10.35s   p(90)=98.38ms  p(95)=417.55ms p(99)=1.74s   
     http_req_failed................: 0.00%   ✓ 0         ✗ 7711 
     ✓ { phase:measure }............: 0.00%   ✓ 0         ✗ 5057 
     ✓ { phase:rampdown }...........: 0.00%   ✓ 0         ✗ 1160 
     ✓ { phase:warmup }.............: 0.00%   ✓ 0         ✗ 1494 
     http_req_receiving.............: avg=563.23µs min=33.4µs  med=190.65µs max=63.61ms  p(90)=535.79µs p(95)=1.77ms   p(99)=9.61ms  
     http_req_sending...............: avg=38.67µs  min=5.78µs  med=29.07µs  max=887.65µs p(90)=74.07µs  p(95)=96.02µs  p(99)=140.95µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=77.71ms  min=1.06ms  med=6.33ms   max=10.34s   p(90)=64.89ms  p(95)=310.45ms p(99)=1.76s   
     http_reqs......................: 7711    12.603153/s
     ✓ { feature:auth }.............: 142     0.23209/s
     ✓ { feature:board }............: 691     1.129397/s
     ✓ { feature:chat }.............: 652     1.065654/s
     ✓ { feature:comment }..........: 1374    2.245718/s
     ✓ { feature:friend }...........: 120     0.196133/s
     ✓ { feature:hot }..............: 691     1.129397/s
     ✓ { feature:mypage }...........: 130     0.212477/s
     ✓ { feature:notification }.....: 343     0.560612/s
     ✓ { feature:post }.............: 3267    5.33971/s
     ✓ { feature:reaction }.........: 149     0.243531/s
     ✓ { feature:school }...........: 56      0.091529/s
     ✓ { feature:scrap }............: 49      0.080087/s
     ✓ { feature:timetable }........: 47      0.076819/s
     ✓ { op:auth }..................: 142     0.23209/s
     ✓ { op:read }..................: 6957    11.370787/s
     ✓ { op:write }.................: 612     1.000276/s
     ✓ { page:0 }...................: 363     0.593301/s
     ✓ { page:1 }...................: 160     0.26151/s
     ✓ { page:2 }...................: 79      0.129121/s
     ✓ { page:3 }...................: 59      0.096432/s
     ✓ { page:4 }...................: 30      0.049033/s
     ✓ { phase:measure }............: 5057    8.265354/s
     ✓ { phase:rampdown }...........: 1160    1.895948/s
     ✓ { phase:warmup }.............: 1494    2.441851/s
     iteration_duration.............: avg=10.01s   min=1s      med=7.41s    max=31.29s   p(90)=19.17s   p(95)=21.61s   p(99)=27.7s   
     iterations.....................: 1799    2.940354/s
     ✓ { phase:measure }............: 0       0/s
     ✓ { phase:rampdown }...........: 0       0/s
     ✓ { phase:warmup }.............: 0       0/s
     phase_iterations...............: 1799    2.940354/s
     ✓ { phase:measure }............: 1195    1.953154/s
     ✓ { phase:rampdown }...........: 281     0.459277/s
     ✓ { phase:warmup }.............: 323     0.527924/s
     vus............................: 1       min=0       max=49 
     vus_max........................: 100     min=100     max=100
     ws_connecting..................: avg=7.54ms   min=1.94ms  med=3.03ms   max=402.95ms p(90)=4.68ms   p(95)=6.99ms   p(99)=33.3ms  
     ws_msgs_received...............: 674     1.101611/s
     ws_msgs_sent...................: 769     1.256883/s
     ws_session_duration............: avg=22.73s   min=15.26s  med=23.02s   max=29.83s   p(90)=28.26s   p(95)=29.16s   p(99)=29.74s  
     ws_sessions....................: 95      0.155272/s